Repository: 84000/data-translation-memory
Catalog: toh163-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of Ratnajālin

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་ཡངས་པ་ཅན་ན། སྤྲེའུ་རྫིང་གི་འགྲམ་ན་ཁང་པ་བརྩེགས་པའི་གནས་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was dwelling in Vaiśālī in a mansion located by the Monkey Pond, together with a great assembly of monks.

source: བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་དང་། སྐྱེ་བ་གཉིས་ཀྱིས་ཐོགས་པ་རྣམས་དང་། སྐྱེ་བ་གསུམ་གྱིས་ཐོགས་པ་རྣམས་དང་། སྐྱེ་བ་བཞིས་ཐོགས་པ་རྣམས་དང་། སྐྱེ་བ་ལྔས་ཐོགས་པ་རྣམས་དང་། སྐྱེ་བ་བཅུས་ཐོགས་པ་རྣམས་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། སྐྱེ་བ་སྟོང་གི་བར་རྣམས་ཀྱིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་དང་།
en: In the assembly were four hundred twenty million bodhisattvas. Some of the bodhisattvas, such as Maitreya, were held back by just one birth, while others were held back by two, three, four, five, ten, thirty, or forty births, with some bodhisattvas even held back by one thousand births.

source: དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་དང་། ལྷ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ལ་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ལྷའི་བུ་ཤིན་ཏུ་དཔལ་བཟང་ལྡན་དང་། ལྷའི་བུ་ཟླ་བའི་འོད་དང་། ལྷའི་བུ་ཉི་མའི་འོད་དང་། ལྷའི་བུ་གྲགས་པའི་ཏོག་དང་། ལྷའི་བུ་མངོན་པར་དགའ་བ་དང་།
en: Also in the assembly were six hundred million worthy ones and nine hundred ninety million gods including the gods in the desire realm and form realm, the four great kings, Śakra who rules the gods, Brahmā who rules the Sahā world, the god Great Splendor, the god Candraprabha, the god Sūryaprabha, the god Pinnacle of Renown, and the god Joyful .

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཀླུའི་རྒྱལ་པོ་ནོར་རྒྱས་ཀྱི་བུ་དང་། གཟི་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་དང་། ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་དང་། ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་ཆེན་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་འཁོར་དང་ཡང་ཐབས་ཅིག་གོ། །
en: In attendance were also the nāga kings Anavatapta, Sāgara, Vāsukin, Manasvin, Nanda, Upananda, Mucilinda, and Mahāmucilinda, as well as the asura sovereign Rāhu and the retinues of all the other asura sovereigns.

source: དེའི་ཚེ་གྲོང་ཁྱེར་ཆེན་པོ་ཡངས་པ་ཅན་ན་དེད་དཔོན་སེང་གེའི་བུ་ལིཙྪ་བཱི་སྟོབས་མཐའ་ཡས་ཞེས་བྱ་བ་ཞིག་གནས་སོ། །
en: At that time, in the city of Vaiśālī, there was a Licchavi named Limitless Strength, who was the son of Siṃha the captain.

source: དེའི་ཚེ་སེང་གེའི་བུ་སྟོབས་མཐའ་ཡས་དེའི་བུ་གཞོན་ནུ་ལིཙྪ་བཱི་རིན་ཆེན་དྲ་བ་ཅན་ཞེས་བྱ་བ་
en: Limitless Strength, son of Siṃha, himself had a son, a young Licchavi boy known as Ratnajālin.

source: སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ།
en: Since this child had previously served many buddhas,

source: ཆོས་ཀྱི་ཚུལ་སྣང་བ་མཐའ་ཡས་པའི་སྒྲོན་མ་དང་ལྡན་པ་ཡང་དག་པར་འཛིན་པ།
en: he had come to possess the lamp that shines with the immense light of the Dharma way.

source: ན་ཚོད་ལོ་བརྒྱད་ལོན་པ་འདྲ་བ་ཞིག་གཉིད་ལོག་སྟེ།
en: One time, when he was around eight years old, he had a dream as he slept.

source: དེའི་རྨི་ལམ་དུ་རྨིས་པ། ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན། དགའ་ལྡན་གྱི་གནས་ནས་བབས་ནས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བསྐུལ་ཏེ་མངོན་པར་སྨྲས་པ།
en: In his dream, the god Santuṣita descended from the Heaven of Joy and spoke to him, encouraging Ratnajālin with this melodious song:

source: སེམས་ཅན་སྙིང་པོ་རྒྱལ་བ་སངས་རྒྱས་ཀྱིས། །སྟོང་གསུམ་འཇིག་རྟེན་སྣང་བ་མཛད་ནས་བཞུགས། །
en: “The essential being, the Victor, the Buddha, Abides, illuminating the entire trichiliocosm.

source: བསོད་ནམས་བརྒྱ་བསགས་གསེར་གྱི་མདོག་འདྲ་བ། །
en: With vast accumulations of merit, he appears in golden hue.

source: བདག་ཉིད་ཆེན་པོ་གཟུགས་ཀྱི་མ་ལུས་མཛེས། །
en: The appearance of this great being is beautiful in all respects.

source: དཀྱིལ་འཁོར་བྱེ་བ་རབ་ཚང་གང་ཡིན་པ། །ཟླ་བ་སྟོང་ངམ་ཡང་ན་བྱེ་བ་ཡི། །འོད་ཟེར་དག་གི་དཀྱིལ་འཁོར་དེ་སྣང་བྱེད། །ཇི་ལྟར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད། །
en: “He is endowed with the light of ten million suns And shines like a thousand or even ten million Luminous full moons— As many as there are grains of sand in the Ganges.

source: དེ་འདྲའི་དཀྱིལ་འཁོར་བྱེ་བར་ཚང་བ་ནི། །ཤར་ཕྱོགས་དཀྱིལ་འཁོར་མཆོག་ནི་སྣང་བྱེད་ཅིང་། །
en: “Shining like many millions of suns, He shines like the supreme disk in the east,

source: དེ་བཞིན་ལྷོ་ཕྱོགས་དེ་བཞིན་ནུབ་ཕྱོགས་དང་། །དེ་བཞིན་བྱང་ཕྱོགས་དཀྱིལ་འཁོར་མཆོག་སྣང་བྱེད། །
en: Those in the south and the west, And the supreme disk in the north.

source: འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་སྤུ་ཡི་ཁུང་། །རེ་རེ་ནས་ནི་འོད་ཟེར་གང་དག་འབྱུང་། །
en: “The light rays that stream forth From each pore of this shining protector of the world Will,

source: རེ་རེ་ནས་ནི་འོད་བྱུང་དེ་དག་གིས། །ཟླ་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་མོག་མོག་མཛད། །
en: each and every one, Make all full moons appear gloomy.

source: ཀུན་གཟིགས་རྣམས་ཀྱིས་སྤུ་ཁུང་རེ་རེ་ནས། །འོད་ཟེར་འབྱུང་ཞིང་སྤུ་ཁུང་རེ་རེ་ནས། །འོད་ཟེར་བྱུང་བ་རྣམས་ཀྱིས་གང་གཱའི་ཀླུང་། །དྲུག་ཅུ་རྩ་དྲུག་བྱེ་སྙེད་རབ་གསལ་མཛད། །
en: “From each pore in the skin of those who are omniscient, Light streams forth. The light that shines from him illuminates as many worlds As there are grains of sand in sixty-six Ganges rivers.”

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་དེའི་མཚན་མོ་འདས་ནས། ཕ་སྟོབས་མཐའ་ཡས་ལ་སྨྲས་པ།
en: In the morning, the Licchavi boy Ratnajālin told his father Limitless Strength,

source: ཡབ་མདང་སུམ་ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན། དགའ་ལྡན་གྱི་གནས་ནས་བབས་ནས་བདག་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བསྐུལ་བ་བགྱིས་པར་གྱུར་ཏོ། །
en: “Father, last night the god Santuṣita arrived from the Heaven of Joy and encouraged me with a melodious song.

source: འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བགྱི་བའི་ལས་བརྩམ་པའི་སླད་དུ་ཡབ་ལ་བདག་གསོལ་བར་བགྱིད་དོ། །
en: Father, I am telling you this so that we can begin the practice of worshiping the Thus-Gone One.”

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་ཕ་སྟོབས་མཐའ་ཡས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: At this point the Licchavi boy Ratnajālin sang these verses to his father Limitless Strength:

source: སེམས་ཅན་ཀུན་གྱི་དེད་དཔོན་རྫོགས་སངས་རྒྱས། །འཇིག་རྟེན་མཁས་པ་བསམ་ཡས་བདག་ཉིད་ཆེ། །སྐྱོབ་པ་དེ་ལ་ཁྱོད་ཀྱིས་མཆོད་དོན་མཛོད། །
en: “The captain of all beings, the perfect Buddha, The great being inconceivably learned in the ways of the world— Please, may you worship this protector,

source: འདྲེན་པ་དེ་ནི་འཇིག་རྟེན་འབྱུང་བར་དཀའ། །
en: For such a guide rarely appears in the world.

source: ཇི་ལྟར་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ནི། །མདོག་ལྡན་མཛེས་ཤིང་ཤིན་ཏུ་དྲི་ཞིམ་ལ། །དྲི་ངད་ལྡན་ཞིང་རྡུལ་བཅོམ་ཉོན་མོངས་མེད། །
en: “Just like the uḍumbara flower, He has a beautiful color and delicious scent and fragrance. He is stainless and without afflictions.

source: དེ་འདྲའི་མེ་ཏོག་མཆོག་ནི་རྙེད་པར་དཀའ། །
en: Such a perfect flower is hard to find.

source: དེའི་ཕྱིར་བདག་གིས་ཡབ་ལ་གསོལ་འདེབས་པ། །
en: “Father, thus I supplicate you:

source: ད་ནི་དགྱེས་པའི་ཐུགས་ཀྱིས་བདག་ལ་གནང་། །གང་ཞིག་འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །དོན་དམ་གཟིགས་པ་ལ་ནི་མཆོད་པར་བགྱིད། །
en: Right now, may you joyfully agree To worship the luminous protector of the world Who perceives the ultimate!”

source: ལིཙྪ་བཱི་སྟོབས་མཐའ་ཡས་སེམས་དགའ་བས། ལིཙྪ་བཱི་སེང་གེ་ཞེས་བྱ་བ་ལ་སྨྲས་པ།
en: The Licchavi Limitless Strength was delighted and addressed the Licchavi Siṃha:

source: དེད་དཔོན་རྒྱལ་བ་ལ་ནི་མཆོད་མཛད་དེབདག་གི་གཞོན་ནུ་བསྟན་ལ་གནས་པར་མཛོད། །
en: “O Captain, follow my son’s advice To worship the Victorious One!”

source: འདྲེན་པ་ཤཱཀྱ་སེང་གེ་མཆོད་པ་དང་། །གཞོན་ནུ་མཆོག་གི་སྤྲོ་བ་བསྐྱེད་པའི་ཕྱིར། །ཁྱིམ་པ་བྱེ་བ་དྲུག་ཅུ་བརྩོན་པར་གྱུར། །
en: To worship the Guide, the Lion of the Śākyas, And to delight the wonderful youth, Six hundred million householders set to work.

source: བརྒྱ་བྱིན་ལྷ་མིག་སྟོང་དང་ལྡན་པ་དང་། །ཚངས་པ་དང་ནི་དབང་ཕྱུག་དབང་སྒྱུར་ལྷ། །བདུད་ཀྱི་བུ་ཕོ་དེད་དཔོན་བཟང་པོ་དང་། །བྱེ་བ་ས་ཡི་ལྷ་དང་ལྷན་ཅིག་ཏུ། །ཡངས་པ་ཅན་གྱི་དགའ་བར་ཐམས་ཅད་ཞུགས། །
en: Śakra with his thousand divine eyes, The powerful gods Brahmā and Īśvara And Susārthavāha, son of Māra, Together with ten million earthly gods, All came to the delight of Vaiśālī.

source: གསེར་ལས་བྱས་དང་དེ་བཞིན་དངུལ་གྱི་ཁྲི། །བྱེ་བ་ཕྲག་ནི་སྟོང་དུ་ཚང་བ་དག །རིན་ཆེན་བདུན་གྱིས་དེ་དག་མཛེས་བྱས་པ། །རེ་རེ་ཡང་ནི་བྱེ་བ་སྟོང་དུ་ཚང་། །
en: Here they produced Billions of thrones made of gold and silver And ornamented with the seven precious substances. Each throne had billions of precious items.

source: ཁྲི་ཡི་གཡས་དང་གཡོན་དུ་རིན་པོ་ཆེ། །རིན་ཆེན་སྣ་བདུན་རྒྱལ་མཚན་བཟང་པོར་བཙུགས། །
en: Each side of the thrones was adorned with jewels And had a fine victory banner of the seven precious substances attached.

source: ཁྲི་དེའི་ཚད་ནི་དཔག་ཚད་རངས་པར་ཡོད། །
en: The size of the thrones was several leagues.

source: རྒྱལ་མཚན་དག་ཀྱང་དཔག་ཚད་ཕྱེད་པར་མཐོ། །
en: The victory banners were half a league high.

source: རྒྱལ་མཚན་རྣམས་ཀྱི་གཡས་དང་གཡོན་དུ་ནི། །དེའི་དྲུང་དཔག་ཚད་བས་མཐོ་སྟེགས་བུ་དག །རང་བཞིན་གཅིག་སྟེ་ནོར་བུ་རིན་པོ་ཆེ། །བྱེ་བ་ལས་བྱས་དཔག་ཚད་མཐོ་བར་འཕགས། །
en: On either side of the victory banners Was a platform higher than a league Made exclusively of a single substance— Precious jewels rising more than a league in height.

source: ཁྲི་ཡི་བར་བར་ལྷ་ཡི་བ་དན་ཡང་། །དཔག་ཚད་བས་ཀྱང་རིང་བ་ཤ་སྟག་དཔྱངས། །
en: In between the thrones divine banners were hung More than a league long.

source: བ་དན་ལྡ་ལྡི་གསེར་གྱི་དྲ་བ་དག །དྲིལ་བུ་གཡེར་ཀ་དག་གིས་མཛེས་པར་བྱས། །
en: The banners featured nets of golden tassels Adorned with strings of bells.

source: ཁྲི་རྣམས་ཀྱི་ནི་འོག་ཏུ་ཀ་བ་ཡང་། །བྱེ་བ་ཕྲག་སྟོང་བྱ་བ་ལེགས་པར་སྦྱར། །
en: Beneath the thrones were well-fastened columns, More than one billion of them.

source: གང་གིས་འདི་རུ་ཁྲི་མཆོག་དེ་དག་ནི། །བརྟན་པར་བྱས་པ་སྒོ་གཏན་བཅུག་པ་བཞིན། །
en: All of these perfect thrones Were firmly placed, as if bolted to the ground.

source: ཁྲི་ཡི་སྟེང་དུ་གསེར་ལས་བྱས་པ་དང་། །གསེར་ལྟ་བུ་དང་དངུལ་དང་བཻ་དཱུརྱ། །དེ་བཞིན་ཤེལ་དང་སྤུག་དང་རྡོ་སྙིང་
en: The surface of the thrones was made of gold— Golden and with silver and beryl, Crystal, coral, and emerald too.

source: དང་། །དེ་བཞིན་རྩ་བ་དང་ནི་ཁོག་པ་ནས། །བྱུང་བ་མིན་པའི་མུ་ཏིག་གདུགས་དག་བྱས། །ཙན་དན་ཤིན་ཏུ་དམར་པོས་དམར་བར་བསྐུས། །རེ་རེ་དག་ནི་བྱེ་བ་སྟོང་དུ་ཚང་། །
en: Also, at the bottom and the base Were placed natural pearl parasols, Numbering in the billions And colored red with deep red sandalwood.

source: ཁྲི་རྣམས་དང་ནི་ཁྲིལ་ཚུལ་ལྟ་བུ་ཡི། །མཁའ་རྟེན་དག་ཀྱང་བྱས་ནས་
en: Having produced the thrones And the heavenly ornaments, clear as water, on the thrones,

source: དེ་ལ་ནི། །གསེར་གྱི་དྲ་བ་དང་ནི་གསེར་ལྟ་བུ། །དངུལ་དང་བཻ་དཱུརྱ་དང་དེ་བཞིན་ཤེལ། །
en: Golden nets were placed on them And adorned with gold, Silver, beryl, and crystal.

source: སྤུག་དང་དེ་བཞིན་རྡོ་ཡི་སྙིང་པོ་ཡི། །མཁའ་རྟེན་སོ་སོ་བྱས་ནས་
en: Having produced the ornaments of coral and emerald,

source: དེ་ལ་ནི། །རིན་ཆེན་དྲིལ་སྒྲ་ཤིན་ཏུ་སྙན་པ་བཏགས། །
en: Affixed to those were sweet-sounding bells

source: རྣམ་འདྲེན་སྒྲ་ནི་རྣམ་པར་གྲགས་པ་ཡི། །མཆོད་པའི་དོན་དུ་བདུག་པ་རབ་ཏུ་བཞག །
en: Resounding with the voice of the Guide. Fumigants were placed there for veneration.

source: ཡངས་པ་ཅན་གྱི་སྟེང་གི་བར་སྣང་ལ། །གསེར་གྱི་སྐུད་པ་ལས་བྱས་བླ་རེ་བྲེས། །
en: In the sky above Vaiśālī Was a canopy sewn of golden thread.

source: གསེར་གྱི་སྐུད་པ་རེ་རེ་མཆོག་ཏུ་བཟང་། །རིན་ཆེན་ཆུན་འཕྱང་སྟོང་ཕྲག་བྱེ་བ་དཔྱངས། །
en: From each and every golden thread Hung billions of tassels of the finest jewels

source: མུ་ཏིག་རྒྱན་འཕྲེང་སྟོང་ཕྲག་བྱེ་བ་ཡང་། །རེ་རེ་གསེར་ལས་བྱས་པའི་སྐུད་པས་བརྒྱུས། །
en: And billions of ornamental garlands of pearl Strung with golden thread.

source: ཡངས་པའི་གྲོང་ཁྱེར་གནས་པའི་ལིཙྪ་བཱི། །གང་དག་གང་དུ་འདོང་བ་དེར་ཉམས་དགའ། །
en: All the Licchavis who lived in the city of Vaiśālī Were joyful, regardless of where they went.

source: དེ་ཚེ་ས་ནི་སྐྱེས་བུ་བདུན་སྲིད་གཡོགས། །གྲོང་ཁྱེར་ཡངས་པ་ཀུན་ཏུ་རས་ཡུག་བཀྲམ། །
en: They covered the ground of the city of Vaiśālī With pieces of cloth the length of seven men

source: དྲ་བ་ཅན་གྱིས་ཙན་དན་དམར་བཏགས་ནས། །རས་རྣམས་ལ་ནི་ལེགས་པར་བསྐུ་བ་བྱས། །
en: Printed with lattices of red sandalwood And made of well-spun fabrics.

source: བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུའི་སིལ་སྙན་དག །རྣམ་པ་སྟོང་རྣམས་གཡས་ཀྱི་ཕྱོགས་ནས་འཁྲོལ། །
en: On the right side, seventy billion instruments Of thousands of different varieties rang forth.

source: གཡོན་གྱི་ཕྱོགས་སུའང་བྱེ་བ་བདུན་ཅུ་སྟོང་། །ཤཱཀྱ་སེང་གེ་མཆོད་པའི་དོན་དུ་བརྩོན། །
en: On the left side, a further seventy billion Were also engaged in venerating the Lion of the Śākyas.

source: དེ་འདྲའི་བཀོད་ཆེན་བྱས་ནས་ལིཙྪ་བཱི། །གཞོན་ནུ་དྲ་བ་ཅན་གྱིས་དེ་ཡི་ཚེ། །དགའ་བའི་སེམས་ཀྱིས་ཕ་མ་ལ་སྨྲས་པ། །
en: Having set forth such a great array, The Licchavi boy named Ratnajālin Joyfully announced to his parents,

source: སངས་རྒྱས་སྤྱན་དྲངས་སླད་དུ་བདག་མཆིའོ། །
en: “I am going before the Buddha.”

source: གྲོང་ཁྱེར་མཆོག་ནས་མཁས་པ་དེ་བྱུང་སྟེརྒྱལ་བདག་ཆེན་པོ་ག་ལ་བར་སོང་ནས། །
en: This learned one left the city And went to where the great victorious lord was staying.

source: ཡོན་ཏན་རྒྱ་མཚོའི་ཞབས་ལ་མགོ་བོ་ཡིས། །ཕྱག་འཚལ་དེར་ནི་གཞོན་ནུ་ཕྱོགས་གཅིག་འདུག །
en: The young man bowed his head at the feet of this ocean of virtues And stood to one side.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then the Licchavi boy Ratnajālin left the city of Vaiśālī and went to where the Blessed One was staying.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: He bowed to the feet of the Blessed One and stood to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་དགའ་བར་མཛད།
en: With him standing there to the side, the Blessed One delivered a Dharma discourse to the Licchavi boy Ratnajālin

source: ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དོ། །
en: that delighted, captivated, and uplifted him, and made him utterly delighted.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The Licchavi boy Ratnajālin then stood up, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms together he bowed toward the Blessed One and asked,

source: བཅོམ་ལྡན་འདས་སང་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་གསོལ་བར་ཅི་གནང་།
en: “Would the Blessed One and his monastic saṅgha agree to take tomorrow’s midday meal at my home?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་ལ་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ། ཅང་མི་གསུང་བར་གྱུར་པས་གནང་ངོ་། །
en: Out of love for the Licchavi boy Ratnajālin, the Blessed One showed his acceptance of the offer by remaining silent.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: The Licchavi boy Ratnajālin understood that the Blessed One had accepted through his silence, and so he circumambulated the Blessed One three times before taking his leave.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ལྷའི་བུ་དཔལ་བཟང་ལྡན་དང་ལྷན་ཅིག་ཏུ་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོར་ཞུགས་སོ། །
en: The Licchavi boy Ratnajālin then entered the city of Vaiśālī along with Śakra who rules the gods, Brahmā who rules the Sahā world, and the god Great Splendor.

source: སྤྲོ་བ་དང་དགའ་བའི་གཟུགས་རྣམས་ཀྱིས་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པའི་རྣམ་པ་སྦྱོར་དུ་བཅུག་གོ། །
en: With enthusiasm and delight, they began to prepare abundant varieties of food.

source: སྦྱར་ནས་དེའི་མཚན་མོ་འདས་པ་དང་གདན་བཤམས་ཤིང་ཡངས་པ་ལེགས་པར་བརྒྱན་ནས།
en: When the night had passed, they set out cushions and decorated Vaiśālī.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: They then returned to the Blessed One, bowed to him, and stood to one side.

source: ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The Licchavi boy Ratnajālin then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་གདུགས་ཚོད་ལ་བབ་སྟེ།
en: “Blessed One, it is time for the midday meal.

source: དེའི་དུས་ལ་ད་བབ་པར་མཁྱེན་ན་གདུགས་ཚོད་ལགས་ཏེ། དུས་ལ་བབ་ལགས་སོ། །
en: If it please you, your meal is ready. The time has come.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། སྨད་གཡོགས་དང་ཆོས་གོས་གསོལ།
en: Accordingly, on that morning the Blessed One donned his lower garments and Dharma robes.

source: ལྷུང་བཟེད་བསྣམས་ཏེ་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དང་ཐབས་ཅིག་ཏུ་སྟེང་གི་བར་སྣང་ལ་མི་བདུན་གྱི་སྲིད་ཙམ་དུ་མངོན་པར་འཕགས་ཏེ་
en: Bearing his alms bowl, with his infinite saṅgha of monks he rose into the sky to the height of seven men and

source: ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་སོ། །
en: traveled to the city of Vaiśālī.

source: བསྐྱོད་མ་ཐག་ཏུ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཐམས་ཅད་རྣམ་པ་དྲུག་ཏུ་འགུལ། རབ་ཏུ་འགུལ། ཀུན་དུ་རབ་ཏུ་འགུལ།
en: As soon as he moved, the transformative power of the Thus-Gone One caused all the worlds of the great trichiliocosm to shake six times as they quivered, trembled, and quaked;

source: གཡོས་རབ་ཏུ་གཡོས། ཀུན་དུ་རབ་ཏུ་གཡོས། ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་དུ་རབ་ཏུ་ལྡེག །འུར་འུར་རབ་ཏུ་འུར་འུར། ཀུན་དུ་རབ་ཏུ་འུར་འུར། ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་དུ་རབ་ཏུ་ཆེམ་ཆེམ་སྟེ།
en: wobbled, rocked, and swayed; vibrated, shuddered, and reeled; clattered, rattled, and clanged; and tremored, shook, and convulsed.

source: ལྟས་བཅྭ་བརྒྱད་དང་ལྡན་པ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: Thus they shook six times with eighteen omens.

source: གཞན་ཡང་ཆོ་འཕྲུལ་བྱེ་བ་ས་ཡ་བརྒྱ་ཕྲག་སྟོང་སྙེད་སྟོན་ཅིང་ཡངས་པ་ཅན་དུ་གཤེགས་སོ། །
en: He also displayed trillions of miracles as he traveled to the city of Vaiśālī.

source: དེའི་ཚེ་ལྷ་བྱེ་བ་ས་ཡ་བརྒྱ་ཕྲག་སྟོང་དུ་མ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་དང་། ལྷའི་རིན་པོ་ཆེ་ལས་བྱས་པའི་མེ་ཏོག་རྣམས་དང་། ལྷའི་ཨ་ག་རུའི་ཕྱེ་མ་དང་། རིན་པོ་ཆེའི་ཕྱེ་མ་དང་། འཛམ་བུ་ཆུ་བོའི་གསེར་དང་། ལྷའི་རིན་པོ་ཆེའི་ཕྱེ་མ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ཏོ། །
en: At that time, trillions of gods scattered and tossed blue, pink, red, and white lotuses, flowers made of precious divine substances, the powdered aloewood of the gods, powdered gems, gold from the Jambu river, and powdered divine gems upon the Blessed One.

source: ལྷའི་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་མངོན་པར་རབ་ཏུ་དཀྲོལ་ཏོ། །
en: Trillions of divine instruments resounded.

source: ལྷའི་རྒྱན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་བརྒྱན་ཏོ། །
en: Unfathomable divine ornaments adorned him.

source: སྟེང་གི་བར་སྣང་ལ་ཙན་དན་དམར་པོ་ཤིང་རྟའི་སྲོག་ཤིང་ཙམ་གྱི་ཆར་གྱི་རྒྱུན་ཕབ་པར་གྱུར་ཏོ། །
en: In the sky above, a steady rain of red sandalwood powder fell to the depth of a chariot axle.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་གྱི་གནས་ག་ལ་བ་དེར་གཤེགས་ཏེ། བྱོན་ནས་གདན་བཤམས་པ་དེ་ལ་བཞུགས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་དང་། དགེ་སློང་མའི་དགེ་འདུན་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མའི་འཁོར་རྣམས་དང་ཐབས་ཅིག་གོ། །
en: The Blessed One then arrived at the Licchavi boy Ratnajālin’s home and sat upon the seat that had been prepared for him along with the saṅghas of fully ordained monks and nuns and the assemblies of novice monks and nuns.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་བཅོམ་ལྡན་འདས་བཞུགས་པར་རིག་ནས་རང་གི་ལག་ནས་བཅའ་བ་དང་། བཟའ་བ་དང་། མྱང་བ་བཟང་པོ་རབ་ཏུ་མང་པོས་ཚིམ་པར་བྱེད་ཅིང་གང་བཞེད་པ་སྟོབ་པར་བྱེད་དོ། །
en: Seeing that he had arrived, the Licchavi boy Ratnajālin personally served the Blessed One with an abundance of the finest food, drink, and sweets, to please him and serve him everything he wished for.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་བཅོམ་ལྡན་འདས་ཀྱིས་ཞལ་ཟས་གསོལ་ལགས་པར་རིག་ནས་ལྷུང་བཟེད་བླངས་ཏེ་ཆབ་ཕུལ་ནས་ཕྱག་བཅབས་སོ། །
en: When the Licchavi boy Ratnajālin noticed that the Blessed One had finished eating, he picked up the alms bowl, offered water, and covered the Blessed One’s hands.

source: བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་རི་བའི་ཆོས་གོས་གསུམ་གྱིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གསོལ་ཏོ། །
en: He then dressed the Blessed One with a priceless set of the three Dharma robes.

source: དགེ་སློང་གི་དགེ་འདུན་དང་། དགེ་སློང་མའི་དགེ་འདུན་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མའི་འཁོར་རྣམས་ལ་ཡང་ཆོས་གོས་གསུམ་གྱིས་མངོན་པར་གཡོགས་ཏེ།
en: He also dressed the saṅghas of fully ordained monks and nuns and the assemblies of novice monks and nuns with sets of the three Dharma robes.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: འདི་ལྟར་དེ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་སོ། །
en: He did this because he was moved by the power of the Blessed One.

source: དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The Licchavi boy Ratnajālin then asked the Blessed One,

source: གལ་ཏེ་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན།
en: “If the Blessed One were to grant me the opportunity to request a teaching,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: I would like to ask the Blessed Thus-Gone One a few questions.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One responded to the Licchavi boy Ratnajālin,

source: གཞོན་ནུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་གང་དང་གང་སོམ་ཉི་ཡོད་པ་ཞུས་ཤིག་དང་།
en: “Young man, you may ask the Thus-Gone One anything you are concerned with.

source: ངས་དེ་དང་དེའི་ཞུ་བ་ལུང་བསྟན་པས་སེམས་རངས་པར་བྱའོ། །
en: Then I shall delight you with teachings that answer your questions.”

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྔོན་གྱི་སྨོན་ལམ་དང་ལྡན་པ་བཞུགས་ཤིང་འཚོ་བ་གང་དག་གི་མཚན་ཐོས་པ་ཙམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་སོམ་ཉི་མ་མཆིས་ཤིང་ཐེ་ཙོམ་མ་མཆིས་པར་འགྱུར།
en: “Blessed One, in other worlds, are there blessed buddhas that through their previous aspirations have names that, when merely heard, help noble sons and daughters who follow the Bodhisattva Vehicle to end all doubt and hesitation,

source: ཕྱིར་མི་ལྡོག་ཅིང་བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་འགྱུར།
en: to become irreversible and fully awaken to unsurpassed and perfect buddhahood,

source: ཚེ་རབས་དྲན་པ་དང་ཡང་ལྡན་པར་འགྱུར།
en: to gain recollection of past lives,

source: ནམ་དུ་ཡང་སེར་སྣའི་སེམས་དང་ལྷན་ཅིག་མི་གནས།
en: to never have a stingy attitude,

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱིས་ཀྱང་ཡོངས་སུ་བསྐོར་བར་འགྱུར། ཉན་ཐོས་ཀྱི་འཁོར་དང་བྲལ་བར་འགྱུར།
en: to be surrounded by the bodhisattva assembly and to be without the assembly of hearers,

source: ཡོན་ཏན་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱིས་ཀྱང་ཡོངས་སུ་བཟུང་བར་འགྱུར།
en: to acquire countless trillions of virtues,

source: སངས་རྒྱས་ཐམས་ཅད་མངོན་པར་དགྱེས་པར་བགྱིས་པས་སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པར་ཚིམ་པར་བགྱིད།
en: to satisfy all beings by pleasing all the buddhas,

source: བདུད་ཐམས་ཅད་ཤིན་ཏུ་སྐྲག་པར་བགྱིད།
en: to terrify the māras,

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྦྱོང་།
en: to purify all buddha realms,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པའི་དྲི་མ་སེལ།
en: to cleanse the stains in the minds of all beings,

source: སེམས་ཅན་ཐམས་ཅད་ཆོས་དཀར་པོ་ལ་ཡང་དག་པར་བསྐུལ།
en: to inspire all beings to the virtuous Dharma,

source: ལྷས་ཀྱང་ཡོངས་སུ་བཟུང་བར་འགྱུར།
en: to be protected by the gods,

source: བྱང་ཆུབ་སེམས་དཔས་ཀྱང་བསམ་པར་འགྱུར།
en: to be considered by the bodhisattvas,

source: དེ་བཞིན་གཤེགས་པས་ཀྱང་བྱིན་གྱིས་རློབ་པར་མཛད།
en: to be blessed by the thus-gone ones,

source: ནམས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་འབྲལ་བར་མི་འགྱུར།
en: to never be separated from the blessed buddhas,

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: to perfect bodhisattva conduct by possessing the finest qualities,

source: སྒྲ་དབྱངས་ཀྱི་རྣམ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡོངས་སུ་རྫོགས་པ་ཐོབ་པར་འགྱུར།
en: to gain the entirety of the 84,000 verbal expressions,

source: ཚངས་པའི་དབྱངས་སུ་འགྱུར།
en: to attain the voice of Brahmā ,

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དང་འཐུན་པའི་སྒྲ་དབྱངས་དང་ལྡན་པ་ལྟ་བཞུགས་ལགས་སམ།
en: and to gain a voice that is in conformity with all worlds?”
